thmalmeida/STM32F10y/src/main.cpp
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "acionna.h"
#include "loadCell.h"
#include <time.h>
#include <stm32f10x.h>
#include <stm32f10x_rtc.h>
#include "stm32f10x_it.h"
#include "Hardware/adc.h"
#include "Hardware/gpio.h"

#include "nokia5110/nokia5110.h"
#include "nokia5110/fonts/fonts.h"

ACIONNA acn;
ADC convert;

LOADCELL weight1;
LOADCELL weight2;
LOADCELL weight3;
LOADCELL weight4;

NOKIA5110 glcd;

// Wake up interrupts
//uint8_t flag_WDRF = 0;			// Watchdog System Reset Flag
//uint8_t flag_BORF = 0;			// Brown-out Reset Flag
//uint8_t flag_EXTRF = 0;			// External Reset Flag
//uint8_t flag_PORF = 0;			// Power-on Reset Flag
//uint16_t var = 0x0003;


uint8_t flag_stable = 0;
int count = 0;
uint8_t tareOrder = 0;
double A[5];
double Kc[5];
int P[5];
uint8_t mode = 0; 			// state machine begins from standard mode 0

void test1()
{
	GPIO pinos;

	pinos.gateConfig(1, 1);
	pinos.gateConfig(5, 1);
	pinos.gateConfig(6, 1);
	pinos.gateConfig(7, 1);
	pinos.gateConfig(8, 1);


	while(1)
	{
		pinos.gateToggle(1);
		pinos.gateToggle(5);
		pinos.gateToggle(6);
		pinos.gateToggle(7);
		pinos.gateToggle(8);
		_delay_ms(1000);
	}
}
void test2()
{
	GPIO pinos;
	pinos.gateConfig(1,1);
	pinos.gateConfig(6,0);
	pinos.gateConfig(7,0);

	int a = 0, b = 0;
	while(1)
	{
		a = pinos.gateRead(6, 0);
		b = pinos.gateRead(7, 0);
		if(a || b)
			pinos.gateSet(1,1);
		else
			pinos.gateSet(1,0);
	}
}

// ----- Weight System -----
void sensor_test()
{	// Function to test sensor by sensor before to fly
	int i;
	int V[5];

	glcd.glcd_clear2();

	for(i=0;i<20;i++)
	{
		V[1] = weight1.readInput();
		sprintf(glcd.buffer,"%9.9d", V[1]);
		glcd.glcd_put_string(0,1,glcd.buffer);

		V[2] = weight2.readInput();
		sprintf(glcd.buffer,"%9.9d", V[2]);
		glcd.glcd_put_string(0,2,glcd.buffer);

		V[3] = weight3.readInput();
		sprintf(glcd.buffer,"%9.9d", V[3]);
		glcd.glcd_put_string(0,3,glcd.buffer);

		V[4] = weight4.readInput();
		sprintf(glcd.buffer,"%9.9d", V[4]);
		glcd.glcd_put_string(0,4,glcd.buffer);

		_delay_ms(500);
	}

}
void showResults()
{
	P[0] = P[1]+P[2]+P[3]+P[4];

	switch (mode)
	{
		case 0:	// kilogram digit only. This 500 grams is useful to create a truncated number. If it is (1600+500)/1000=2.1 = 2; else if it is (1499+500)/1000=1.99 = 1
		{
//			if(P[0]>0)
				sprintf(glcd.buffer,"%5.1d", (P[0]+500)/1000);			// 0 digitos;
//			else
//				sprintf(glcd.buffer,"%5.1d", (P[0]-500)/1000);			// 0 digitos;

			glcd.glcd_Arial16x24_str(4,1,glcd.buffer);
			glcd.glcd_put_string(72,5,"kg");					// unit print;
			sprintf(glcd.buffer,"e:%8.1d",weight3.error);
			glcd.glcd_put_string(0,5,glcd.buffer);
		}
		break;
		case 1:	// kilogram digit and decimal floating point
		{
			if(P[0]/100%10 < 0)
			{
				if((P[0]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");					// 0 digitos;
				}

				sprintf(glcd.buffer,"%.1d", abs(P[0])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);

			}
			else
			{
				sprintf(glcd.buffer,"%4.1d", P[0]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,glcd.buffer);

				sprintf(glcd.buffer,"%.1d", P[0]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;
		}
		break;
		case 2:	// All weights with 2 decimal floating point
		{
			sprintf(glcd.buffer,"Pt: %7.1d.%.2d", P[0]/1000, (P[0]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,1,glcd.buffer);

			sprintf(glcd.buffer,"P1: %7.1d.%.2d", P[1]/1000, abs(P[1]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,2,glcd.buffer);

			sprintf(glcd.buffer,"P2: %7.1d.%.2d", P[2]/1000, abs(P[2]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,3,glcd.buffer);

			sprintf(glcd.buffer,"P3: %7.1d.%.2d", P[3]/1000, abs(P[3]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,4,glcd.buffer);

			sprintf(glcd.buffer,"P4: %7.1d.%.2d", P[4]/1000, abs(P[4]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,5,glcd.buffer);

			sprintf(glcd.buffer,"s%d", mode);						// mode print;
			glcd.glcd_put_string(72,0,glcd.buffer);
		}
		break;
		case 3:	// Sensor 1 debugging
		{
			if(P[1]/100%10 < 0)
			{
				if((P[1]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
				}

				sprintf(glcd.buffer,"%.1d", abs(P[1])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);

			}
			else
			{
				sprintf(glcd.buffer,"%4.1d", P[1]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,glcd.buffer);

				sprintf(glcd.buffer,"%.1d", P[1]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(glcd.buffer,"o: %8d", weight1.offset);		// offset show;
			glcd.glcd_put_string(0,5,glcd.buffer);

			sprintf(glcd.buffer,"s: %8d", weight1.signal);		// signal show;
			glcd.glcd_put_string(0,0,glcd.buffer);

			sprintf(glcd.buffer,"s%d", 1);						// mode print;
			glcd.glcd_put_string(72,0,glcd.buffer);
		}
		break;
		case 4:	// Sensor 2 debugging
		{
			if(P[2]/100%10 < 0)
			{
				if((P[2]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
				}

				sprintf(glcd.buffer,"%.1d", abs(P[2])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);

			}
			else
			{
				sprintf(glcd.buffer,"%4.1d", P[2]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,glcd.buffer);

				sprintf(glcd.buffer,"%.1d", P[2]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(glcd.buffer,"o: %8d", weight2.offset);		// offset show;
			glcd.glcd_put_string(0,5,glcd.buffer);

			sprintf(glcd.buffer,"s: %8d", weight2.signal);		// signal show;
			glcd.glcd_put_string(0,0,glcd.buffer);

			sprintf(glcd.buffer,"s%d", 2);						// mode print;
			glcd.glcd_put_string(72,0,glcd.buffer);
		}
		break;
		case 5:	// Sensor 3 debugging
		{
			if(P[3]/100%10 < 0)
			{
				if((P[3]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
				}

				sprintf(glcd.buffer,"%.1d", abs(P[3])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);

