thmalmeida/STM32F10y/src/main.cpp
			}
			else
			{
				sprintf(glcd.buffer,"%4.1d", P[3]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,glcd.buffer);

				sprintf(glcd.buffer,"%.1d", P[3]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(glcd.buffer,"o: %8d", weight3.offset);		// offset show;
			glcd.glcd_put_string(0,5,glcd.buffer);

			sprintf(glcd.buffer,"s: %8d", weight3.signal);		// signal show;
			glcd.glcd_put_string(0,0,glcd.buffer);

			sprintf(glcd.buffer,"s%d", 3);						// mode print;
			glcd.glcd_put_string(72,0,glcd.buffer);
		}
		break;
		case 6:	// Sensor 4 debugging
		{
			if(P[4]/100%10 < 0)
			{
				if((P[4]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
				}

				sprintf(glcd.buffer,"%.1d", abs(P[4])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);

			}
			else
			{
				sprintf(glcd.buffer,"%4.1d", P[4]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,glcd.buffer);

				sprintf(glcd.buffer,"%.1d", P[4]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(glcd.buffer,"o: %8d", weight4.offset);		// offset show;
			glcd.glcd_put_string(0,5,glcd.buffer);

			sprintf(glcd.buffer,"s: %8d", weight4.signal);		// signal show;
			glcd.glcd_put_string(0,0,glcd.buffer);

			sprintf(glcd.buffer,"s%d", 4);						// mode print;
			glcd.glcd_put_string(72,0,glcd.buffer);
		}
		break;
		case 7: // Small Sensor 1 debugging
		{
			if(P[4]/100%10 < 0)
			{
				if((P[4]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
				}

				sprintf(glcd.buffer,"%.1d", abs(P[4])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);

			}
			else
			{
				sprintf(glcd.buffer,"%4.1d", P[4]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,glcd.buffer);

				sprintf(glcd.buffer,"%.1d", P[4]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5," g");						// unit print;

			sprintf(glcd.buffer,"o: %8d", weight4.offset);		// offset show;
			glcd.glcd_put_string(0,5,glcd.buffer);


			sprintf(glcd.buffer,"s: %8d", weight4.signal);		// signal show;
			glcd.glcd_put_string(0,0,glcd.buffer);

//			sprintf(glcd.buffer,"p: %8d", P[1]);		// signal show;
//			glcd.glcd_put_string(0,0,glcd.buffer);

			glcd.glcd_put_string(72,0,"sm");
		}
		break;
		case 8:	// All weights with 2 decimal floating point
		{
			sprintf(glcd.buffer,"P1: %7.1d.%.2d", P[1]/1000, abs(P[1]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,2,glcd.buffer);

			sprintf(glcd.buffer,"P2: %7.1d.%.2d", P[2]/1000, abs(P[2]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,3,glcd.buffer);

			sprintf(glcd.buffer,"P3: %7.1d.%.2d", P[3]/1000, abs(P[3]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,4,glcd.buffer);

			sprintf(glcd.buffer,"P4: %7.1d.%.2d", P[4]/1000, abs(P[4]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,5,glcd.buffer);

			sprintf(glcd.buffer,"s%d", mode);						// mode print;
			glcd.glcd_put_string(72,0,glcd.buffer);
		}
//		case 6:
////			P[0] = P[1]+P[2]+P[3]+P[4];
//
//			sprintf(glcd.buffer,"Pt: %7.1d.%.1d", abs(P[0])/1000, abs(P[0])/100%10);			// 1 digitos;
//			glcd.glcd_put_string(0,1,glcd.buffer);
//
//			sprintf(glcd.buffer,"P1: %7.1d.%.1d", abs(P[1])/1000, abs(P[1])/100%10);			// 1 digitos;
//			glcd.glcd_put_string(0,2,glcd.buffer);
//
//			sprintf(glcd.buffer,"P2: %7.1d.%.1d", abs(P[2])/1000, abs(P[2])/100%10);			// 1 digitos;
//			glcd.glcd_put_string(0,3,glcd.buffer);
//
//			sprintf(glcd.buffer,"P3: %7.1d.%.1d", abs(P[3])/1000, abs(P[3])/100%10);			// 1 digitos;
//			glcd.glcd_put_string(0,4,glcd.buffer);
//
//	//		sprintf(glcd.buffer,"P4: %7.1d", P[4]);				// whole digits in GRAMS [g];
//			sprintf(glcd.buffer,"P4: %7.1d.%.1d", abs(P[4])/1000, abs(P[4])/100%10);			// 1 digitos;
//			glcd.glcd_put_string(0,5,glcd.buffer);
//
//			sprintf(glcd.buffer,"s%d", mode);						// mode print;
//			glcd.glcd_put_string(72,0,glcd.buffer);
//			break;
//		case 7: // the whole weight
////			P[0] = P[1]+P[2]+P[3]+P[4];
//
//			weight1.offset = 11500;
//			weight2.offset = 5000;
//			weight3.offset = 11500;
//			weight4.offset = 11500;
//
//			static const int index = 0;
//
//			if(P[index]/100%10 < 0)
//			{
//				if((P[0]/1000) == 0)
//				{
//					glcd.glcd_dot_print(35,2,9,0xC0);				// minus signal;
//					glcd.glcd_dot_print(35,3,9,0x01);				// minus signal;
//					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
//				}
//
//				sprintf(glcd.buffer,"%.1d", abs(P[index])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
//				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);
//
//			}
//			else
//			{
//				sprintf(glcd.buffer,"%4.1d", P[index]/1000);		// 0 digitos;
//				glcd.glcd_Arial16x24_str(4,1,glcd.buffer);
//
//				sprintf(glcd.buffer,"%.1d", P[index]/100%10);		// 1 digitos; divide by centesimum part and use 10 by 10.
//				glcd.glcd_Arial16x24_str(68,1,glcd.buffer);
//			}
//			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
//			glcd.glcd_put_string(72,5,"kg");						// unit print;
//
//			sprintf(glcd.buffer,"o: %8d", weight1.offset);		// offset show;
//			glcd.glcd_put_string(0,5,glcd.buffer);
//
//			sprintf(glcd.buffer,"s: %8d", weight1.signal);		// signal show;
//			glcd.glcd_put_string(0,0,glcd.buffer);
//
//			sprintf(glcd.buffer,"s%d", mode);						// mode print;
//			glcd.glcd_put_string(72,0,glcd.buffer);
//			break;
//		case 8:
//			sprintf(glcd.buffer,"%.1d.%.2d   %.1d.%.2d", P[1]/1000, abs(P[1]/10)%100, P[2]/1000, abs(P[2]/10)%100);	// 2 digitos;
//			glcd.glcd_put_string(0,0,glcd.buffer);
//			sprintf(glcd.buffer,"%.1d.%.2d   %.1d.%.2d", P[3]/1000, abs(P[3]/10)%100, P[4]/1000, abs(P[4]/10)%100);	// 2 digitos;
//			glcd.glcd_put_string(0,1,glcd.buffer);
//
//			sprintf(glcd.buffer,"%d", weight1.signal);		// signal show;
//			glcd.glcd_put_string(0,2,glcd.buffer);
//			sprintf(glcd.buffer,"%d", weight1.offset);		// offset show;
//			glcd.glcd_put_string(46,2,glcd.buffer);
//
//			sprintf(glcd.buffer,"%d", weight2.signal);		// signal show;
//			glcd.glcd_put_string(0,3,glcd.buffer);
//			sprintf(glcd.buffer,"%d", weight2.offset);		// offset show;
//			glcd.glcd_put_string(46,3,glcd.buffer);
//
//			sprintf(glcd.buffer,"%d", weight3.signal);		// signal show;
//			glcd.glcd_put_string(0,4,glcd.buffer);
//			sprintf(glcd.buffer,"%d", weight3.offset);		// offset show;
//			glcd.glcd_put_string(46,4,glcd.buffer);
//
//			sprintf(glcd.buffer,"%d", weight4.signal);		// signal show;
//			glcd.glcd_put_string(0,5,glcd.buffer);
//			sprintf(glcd.buffer,"%d", weight4.offset);		// offset show;
//			glcd.glcd_put_string(46,5,glcd.buffer);
//
////				sprintf(glcd.buffer,"s%d", mode);						// mode print;
////				glcd.glcd_put_string(72,0,glcd.buffer);
//			break;
//		default:
////				sprintf(glcd.buffer,"%4.1d", abs(P[0])/1000);			// 1 digitos;
////				sprintf(glcd.buffer,"%3.1d.%.1d", abs(P[mode])/1000, abs(P[mode])/100%10);			// 1 digitos;
////				sprintf(glcd.buffer,"%3.1d.%.1d", abs(P[mode])/1000, abs(P[mode])/100%10);			// 1 digitos;
//
////				sprintf(glcd.buffer,"%.1d", abs(P[0])/100%10);		// 1 digitos;
////				sprintf(glcd.buffer,"%.2d", abs(P[0])/10%100);		// 2 digitos;
////				sprintf(glcd.buffer,"%.3d", abs(P[0])%1000);			// 3 digitos;
////				glcd.glcd_big_str(8,2,glcd.buffer);
//
//			sprintf(glcd.buffer,"%4.1d", abs(P[mode])/1000);			// 0 digitos;
//			glcd.glcd_Arial16x24_str(4,1,glcd.buffer);
//			glcd.glcd_dot_print(65,4,3,0x07);
//			sprintf(glcd.buffer,"%.1d", abs(P[mode])/100%10);		// 1 digitos;
//			glcd.glcd_Arial16x24_str(68,1,glcd.buffer);
//
//			sprintf(glcd.buffer,"s%d", mode);
//			glcd.glcd_put_string(0,0,glcd.buffer);
//			glcd.glcd_put_string(72,5,"kg");
//		break;
	}
}
void initialize()
{
	/*
	 * Initial weight of cattle contention by foot
	 *
	 * P1:  420.41 kg
	 * P2:  340.86 kg
	 * P3:  401.14 kg
	 * P4:  360.24 kg
	 * Pt: 1522.65 kg
	 */

	init();					// uC basic peripherals setup
	acn.begin_acn();		// Class acionna statement
	glcd.glcd_init(1);		// nokia 5110 graphic lcd init


	A[0] = 1.0000;			// 1kg load bar (small load cell sensor)
	A[1] = 2.9997;			// s1
	A[2] = 3.0000;			// s2
	A[3] = 3.0017;			// s3
	A[4] = 3.0012;			// s4

	Kc[0] = 10*1.3629;		// proportional constant of small 1kg load bar sensor
	Kc[1] = 1.0872;
	Kc[2] = 1.6200;			// YZC-320 tested on 20170816 with 3.0mV/V and Kc = 1.6985;
	Kc[3] = 1.0872;			//10.33%
	Kc[4] = 1.0872;

	weight1.offset = 11500;	// s1
	weight2.offset = 5000;	// s2
	weight3.offset = 11500; // s3
	weight4.offset = 11500;	// s4

