thmalmeida/STM32F10y/src/main.cpp
	weight1.begin_loadcell( 7,  6, A[1], Kc[1]);
	weight2.begin_loadcell(32, 31, A[2], Kc[2]);
	weight3.begin_loadcell(19, 18, A[3], Kc[3]);
	weight4.begin_loadcell(17, 16, A[4], Kc[4]);

	if(mode >= 7)
	{
		weight1.A = A[0];
		weight1.Kp = Kc[0];

		weight2.A = A[0];
		weight2.Kp = Kc[0];

		weight3.A = A[0];
		weight3.Kp = Kc[0];

		weight4.A = A[0];
		weight4.Kp = Kc[0];
	}
	if(mode<7)
	{
		weight1.A = A[1];
		weight1.Kp = Kc[1];

		weight2.A = A[2];
		weight2.Kp = Kc[2];

		weight3.A = A[3];
		weight3.Kp = Kc[3];

		weight4.A = A[4];
		weight4.Kp = Kc[4];
	}

	// Initializing...
	glcd.glcd_clear2();
	weight1.drive_beep(1, 100, 0);
	strcpy(glcd.buffer, "Inicializando");
	glcd.glcd_put_string(0,0,glcd.buffer);

	strcpy(glcd.buffer, "thmalmeida SYS");
	glcd.glcd_put_string(0,2,glcd.buffer);

	sensor_test();
	// Function to test sensor by sensor before to fly
//	int i;
//	for(i=1;i<=4;i++)
//	{
//		strcpy(glcd.buffer, "Sensor 1...");
//		glcd.glcd_put_string(0,3,glcd.buffer);
//		P[1] = weight1.get_weight();
//
//	}



	// This process find the initial weight. 50 iteraction suppose to be a good try
//	for(i=0;i<50;i++)
//	{
//		P[1] = weight1.get_weight();
//		P[2] = weight2.get_weight();
//		P[3] = weight3.get_weight();
//		P[4] = weight4.get_weight();
//	}
	glcd.glcd_clear2();
}
void weight_process()
{
	//	int c = 0;
	//	while(1)
	//	{
	//		sprintf(glcd.buffer, "%d", c);
	//		glcd.glcd_put_string(0,0,glcd.buffer);
	//		c++;
	//	}

//	test2();
	initialize();

	while(1)
	{
		P[1] = weight1.get_weight();
		P[2] = weight2.get_weight();
		P[3] = weight3.get_weight();
		P[4] = weight4.get_weight();

		count = 0;
		while(weight1.readTareButton())
		{
			count++;
			tareOrder = 1;

			if(count > 20)
			{
				tareOrder = 0;
				count = 0;
				mode++;
				weight1.drive_beep(2, 10, 10);
				if(mode == 7)
				{
					weight1.A = A[0];
					weight1.Kp = Kc[0];

					weight2.A = A[0];
					weight2.Kp = Kc[0];

					weight3.A = A[0];
					weight3.Kp = Kc[0];

					weight4.A = A[0];
					weight4.Kp = Kc[0];
				}
				if(mode > 8)
				{
					mode = 0;
					weight1.A = A[1];
					weight1.Kp = Kc[1];

					weight2.A = A[2];
					weight2.Kp = Kc[2];

					weight3.A = A[3];
					weight3.Kp = Kc[3];

					weight4.A = A[4];
					weight4.Kp = Kc[4];
				}
				glcd.glcd_clear2();
				sprintf(glcd.buffer,"MODE %d", mode);			// 1 digito;
				glcd.glcd_put_string(20,2,glcd.buffer);
				while(weight1.readTareButton());
				glcd.glcd_clear2();
			}
		}

		if(tareOrder)
		{
			tareOrder = 0;

			weight1.tareSystem3();
			weight2.tareSystem3();
			weight3.tareSystem3();
			weight4.tareSystem3();
			glcd.glcd_clear2();
			weight1.drive_beep(1, 10, 0);
		}

		if(acn.flag_1s == 1)			// in each 1 second interval, print the weight
		{
			acn.flag_1s = 0;

			showResults();				// Show results on screen

			switch(mode)				// This is
			{
			case 7:
				if(!weight4.stable) 	// if not stable, clear stable flag.
				{
					flag_stable = 0;
				}
				if(!flag_stable)		// if not stable, join here
				{
					if(weight4.stable)	// if become stable and has some weight, beep it!
					{
						flag_stable = 1;
						glcd.glcd_hash_print(0,1);
						if(P[1] > 5000)
						{
							weight4.drive_led(1);
							weight4.drive_beep(1, 200, 0);
						}
					}
					else
					{
						weight4.drive_led(0);
						glcd.glcd_space_print(0,1);	// clear the hash.
					}
				}
				break;
			default:
				if(!weight1.stable || !weight2.stable || !weight3.stable || !weight4.stable) 	// if at least one sensor is not stable, then...
				{
					flag_stable = 0;
					glcd.glcd_space_print(0,0);	// clear the hash.
				}

				if(!flag_stable)
				{
					if(weight1.stable && weight2.stable && weight3.stable && weight4.stable)
					{
						flag_stable = 1;

						if(P[0] > 8000)
						{
							weight1.drive_beep(1, 200, 0);
							glcd.glcd_hash_print(0,0);
							weight1.drive_led(1);
						}
					}
					else
					{
						weight1.drive_led(0);
					}
				}
				break;
			}
		}
//		sprintf(glcd.buffer,"%4.1d.%.2d", P/(weight.Waccu*10), abs(P%(weight.Waccu))/100);	// 2 digitos

//		sprintf(glcd.buffer,"P:%.3d.%.3d kg", abs(P/1000), abs(P)%1000);		// 3 digitos;
//		sprintf(glcd.buffer,"P:%.3d.%.2d kg", abs(P/1000), abs(P/10)%100);	// 2 digitos;
//		sprintf(glcd.buffer,"%.4d.%.1d", abs(P)/1000, abs(P)/100%10);			// 1 digitos;
//		glcd.glcd_put_string(0,2,glcd.buffer);

//		sprintf(glcd.buffer,"%4.1d", abs(P[0])/1000);		// kilogram digit;
//		glcd.glcd_Arial16x24_str(1,1,glcd.buffer);
//		glcd.glcd_dot_print(65,4,3);
//


//		acn.comm_Bluetooth();
//
//		acn.refreshVariables();
//
//		acn.handleMessage();
//
//		acn.process_Mode();
//		if(acn.flag_1s)
//		{
//			acn.flag_1s = 0;
//
//			rtc.getTime();
//			sprintf(buffer, "%s", ctime(&rtc.rawtime));
//			Serial.println(buffer);
//		}
	}
}

// ----- Water System Machine ----- //
void waterSystem_process()		//
{
	init();							// uC basic peripherals setup

	acn.begin_acn();				// Class acionna statement
	acn.blink_led(2, 150);
	Serial.begin(9600);				// Initialize USART1 @ 9600 baud
	Serial.println("Acionna v2.1");

	// the main process comes here!
	while(1)
	{
		acn.comm_Bluetooth();

		acn.refreshVariables();

		acn.handleMessage();

		acn.process_Mode();

//		acn.drive_led_toggle();
	}
}

int main(void)
{
	waterSystem_process();

//	or

//	weight_process();

	return 0;
}

























//int main(void)
//{
//	init();							// uC basic peripherals setup
//
//	acn.begin_acn();				// Class acionna statement
////	Serial.begin(9600);				// Initialize USART1 @ 9600 baud
////	Serial.println("Acionna v2.0");
//	acn.blink_led(2, 150);
//	weight.begin_loadcell();
//
////	char c='0';
////
////	while(1)
////	{
////		sprintf(glcd.buffer, "a: %c", c++);
////		Serial.println(glcd.buffer);
////		_delay_ms(500);
////	}
//
////	int c=10;
////	while(1)
////	{
////		sprintf(glcd.buffer,"%4.1d g", c);
////		glcd.glcd_big_str(0,0, glcd.buffer);
////		c++;
////		_delay_ms(500);
////	}
//
//	weight.example1();
//
//	while(1)
//	{
////		acn.comm_Bluetooth();
////
////		acn.refreshVariables();
////
////		acn.handleMessage();
////
////		acn.process_Mode();
//	}
//}

//const char * m()
//{
//    char * c = (char *)malloc(6 * sizeof(char));
//    c = "hello";
//    return (const char *)c;
//}
//
//int main(int argc, char * argv[])
//{
//    const char * d = m();
//    std::cout << d; // use PCSTR
//}


